byte TP = 0b10101010;

void setup() {
  // Настройка порта C на выход
  DDRC = 0b11111111;

  // Инициализация таймера 1
  noInterrupts();           // Отключение прерываний
  TCCR1A = 0;               // Очистка регистра управления A
  TCCR1B = 0;               // Очистка регистра управления B
  TCNT1 = 0;                // Сброс счетчика таймера

  OCR1A = 200;              // Установка значения для сравнения

  TCCR1B |= (1 << WGM12);   // Режим CTC (сравнение с OCR1A)
  TCCR1B |= (1 << CS10);    // Тактирование без делителя

  TIMSK1 |= (1 << OCIE1A);  // Разрешение прерывания по совпадению OCR1A
  interrupts();             // Включение прерываний
}

ISR(TIMER1_COMPA_vect) {
  PORTC = TP;
  TP = ~TP;
}

void loop() {
  // Пустой loop — основная логика в прерывании
}
